In [1]:
import pandas as pd
d = pd.Series(range(20))
d

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
dtype: int64

计算前n项累加和

In [3]:
d.cumsum()

0       0
1       1
2       3
3       6
4      10
5      15
6      21
7      28
8      36
9      45
10     55
11     66
12     78
13     91
14    105
15    120
16    136
17    153
18    171
19    190
dtype: int64

# Series

In [4]:
import pandas as pd
a = pd.Series([9,8,7,6])
a

0    9
1    8
2    7
3    6
dtype: int64

自定义索引

In [5]:
import pandas as pd
a = pd.Series([9,8,7,6],index=['a','b','c','d'])
a

a    9
b    8
c    7
d    6
dtype: int64

从标量值创建

In [6]:
import pandas as pd
s = pd.Series(25,index=['a','b','c'])
s

a    25
b    25
c    25
dtype: int64

从字典类型创建

In [7]:
import pandas as pd
d = pd.Series({'a':9,'b':8,'c':7})
d

a    9
b    8
c    7
dtype: int64

In [8]:
import pandas as pd
d = pd.Series({'a':9,'b':8,'c':7},index=['c','a','b','d'])
d

c    7.0
a    9.0
b    8.0
d    NaN
dtype: float64

ndarray

In [9]:
import pandas as pd
import numpy as np

n = pd.Series(np.arange(5))
n

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [10]:
m = pd.Series(np.arange(5),index=np.arange(9,4,-1))
m

9    0
8    1
7    2
6    3
5    4
dtype: int32

# Series类型的基本操作

In [13]:
import pandas as pd
b = pd.Series([9,8,7,6],['a','b','c','d'])
b

a    9
b    8
c    7
d    6
dtype: int64

In [14]:
b.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [16]:
b.values

array([9, 8, 7, 6], dtype=int64)

In [17]:
b['b']

8

In [18]:
b[1]

8

In [23]:
b[['c','d','a']]

c    7
d    6
a    9
dtype: int64

In [24]:
import pandas as pd
b = pd.Series([9,8,7,6],['a','b','c','d'])
b

a    9
b    8
c    7
d    6
dtype: int64

In [25]:
b[3]

6

In [26]:
b[:3]

a    9
b    8
c    7
dtype: int64

In [29]:
b.median()

7.5

In [27]:
b[b>b.median()]

a    9
b    8
dtype: int64

In [28]:
np.exp(b)

a    8103.083928
b    2980.957987
c    1096.633158
d     403.428793
dtype: float64

In [30]:
import pandas as pd
b = pd.Series([9,8,7,6],['a','b','c','d'])
b

a    9
b    8
c    7
d    6
dtype: int64

In [31]:
b['b']

8

in不会判断自动索引，只会判断保留字索引

In [32]:
'c' in b

True

In [33]:
0 in b

False

In [34]:
b.get('f',100)

100

# Series类型对齐操作

In [35]:
import pandas as pd

a = pd.Series([1,2,3],['c','d','e'])
b = pd.Series([9,8,7,6],['a','b','c','d'])
a+b

a    NaN
b    NaN
c    8.0
d    8.0
e    NaN
dtype: float64

# name

In [36]:
import pandas as pd
b = pd.Series([9,8,7,6],['a','b','c','d'])
b

a    9
b    8
c    7
d    6
dtype: int64

In [38]:
b.name = 'Serise对象'

In [40]:
b.index.name = '索引列'

In [41]:
b

索引列
a    9
b    8
c    7
d    6
Name: Serise对象, dtype: int64

In [42]:
b['a'] = 15

In [43]:
b

索引列
a    15
b     8
c     7
d     6
Name: Serise对象, dtype: int64

In [44]:
b.name =  'New Series'

In [45]:
b

索引列
a    15
b     8
c     7
d     6
Name: New Series, dtype: int64

In [46]:
b['b','c'] = 20

In [47]:
b

索引列
a    15
b    20
c    20
d     6
Name: New Series, dtype: int64

# DataFrame

In [2]:
import pandas as pd
import numpy as np
d = pd.DataFrame(np.arange(10).reshape(2,5))
d

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

In [3]:
import pandas as pd
dt = {'one':pd.Series([1,2,3],index=['a','b','c']),
     'two':pd.Series([9,8,7,6],index=['a','b','c','d'])}
d = pd.DataFrame(dt)
d

   one  two
a  1.0    9
b  2.0    8
c  3.0    7
d  NaN    6

In [6]:
pd.DataFrame(dt,index=['a','b','c','d'],columns=['two','three'])

   two three
a    9   NaN
b    8   NaN
c    7   NaN
d    6   NaN

 列表类型的字典

In [8]:
dl = {'one':[1,2,3,4],'two':[9,8,7,6]}
d = pd.DataFrame(dl,index=['a','b','c','d'])
d

   one  two
a    1    9
b    2    8
c    3    7
d    4    6

中文

In [9]:
import pandas as pd

In [32]:
dl = {'城市':['北京','上海','广州','深圳','沈阳'],
      '环比':['101.5','101.2','101.3','102.0','100.1'],
      '同比':['120.7','127.3','119.4','140.9','101.4'],
      '定基':['121.4','127.8','120.0','145.5','101.6']}
d = pd.DataFrame(dl,index=['c1','c2','c3','c4','c5'])
d

    城市     环比     同比     定基
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5
c5  沈阳  100.1  101.4  101.6

In [33]:
d.index

Index(['c1', 'c2', 'c3', 'c4', 'c5'], dtype='object')

In [34]:
d.columns

Index(['城市', '环比', '同比', '定基'], dtype='object')

In [35]:
d.values

array([['北京', '101.5', '120.7', '121.4'],
       ['上海', '101.2', '127.3', '127.8'],
       ['广州', '101.3', '119.4', '120.0'],
       ['深圳', '102.0', '140.9', '145.5'],
       ['沈阳', '100.1', '101.4', '101.6']], dtype=object)

In [36]:
d['同比']

c1    120.7
c2    127.3
c3    119.4
c4    140.9
c5    101.4
Name: 同比, dtype: object

In [37]:
d.loc['c2']

城市       上海
环比    101.2
同比    127.3
定基    127.8
Name: c2, dtype: object

In [28]:
d['同比']['c2']

'127.3'

In [38]:
d = d.reindex(index = ['c5','c4','c3','c2','c1'])
d

    城市     环比     同比     定基
c5  沈阳  100.1  101.4  101.6
c4  深圳  102.0  140.9  145.5
c3  广州  101.3  119.4  120.0
c2  上海  101.2  127.3  127.8
c1  北京  101.5  120.7  121.4

In [39]:
d = d.reindex(columns = ['城市','同比','环比','定基'])
d

    城市     同比     环比     定基
c5  沈阳  101.4  100.1  101.6
c4  深圳  140.9  102.0  145.5
c3  广州  119.4  101.3  120.0
c2  上海  127.3  101.2  127.8
c1  北京  120.7  101.5  121.4

In [43]:
newc = d.columns.insert(4,'新增')
newd = d.reindex(columns=newc,fill_value=200)
newd

    城市     同比     环比     定基   新增
c5  沈阳  101.4  100.1  101.6  200
c4  深圳  140.9  102.0  145.5  200
c3  广州  119.4  101.3  120.0  200
c2  上海  127.3  101.2  127.8  200
c1  北京  120.7  101.5  121.4  200

In [44]:
d.index

Index(['c5', 'c4', 'c3', 'c2', 'c1'], dtype='object')

In [45]:
d.columns

Index(['城市', '同比', '环比', '定基'], dtype='object')

In [54]:
nc = d.columns.delete(2)

In [58]:
ni = d.index.insert(5,'c0')

In [59]:
nd = d.reindex(index=ni,columns=nc).ffill()
nd

    城市     同比     定基
c5  沈阳  101.4  101.6
c4  深圳  140.9  145.5
c3  广州  119.4  120.0
c2  上海  127.3  127.8
c1  北京  120.7  121.4
c0  北京  120.7  121.4

In [60]:
a = pd.Series([9,8,7,6],index=['a','b','c','d'])
a

a    9
b    8
c    7
d    6
dtype: int64

In [61]:
a.drop(['b','c'])

a    9
d    6
dtype: int64

In [62]:
d.drop('c5')

    城市     同比     环比     定基
c4  深圳  140.9  102.0  145.5
c3  广州  119.4  101.3  120.0
c2  上海  127.3  101.2  127.8
c1  北京  120.7  101.5  121.4

In [63]:
d.drop('同比',axis=1)

    城市     环比     定基
c5  沈阳  100.1  101.6
c4  深圳  102.0  145.5
c3  广州  101.3  120.0
c2  上海  101.2  127.8
c1  北京  101.5  121.4

# 数据类型运算

In [68]:
import pandas as pd
import numpy as np
a = pd.DataFrame(np.arange(12).reshape(3,4))
a

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [71]:
b = pd.DataFrame(np.arange(20).reshape(4,5))
b

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [72]:
a + b

      0     1     2     3   4
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [73]:
a * b

      0     1      2      3   4
0   0.0   1.0    4.0    9.0 NaN
1  20.0  30.0   42.0   56.0 NaN
2  80.0  99.0  120.0  143.0 NaN
3   NaN   NaN    NaN    NaN NaN

将缺少的元素用100补齐

In [74]:
b.add(a,fill_value=100)

       0      1      2      3      4
0    0.0    2.0    4.0    6.0  104.0
1    9.0   11.0   13.0   15.0  109.0
2   18.0   20.0   22.0   24.0  114.0
3  115.0  116.0  117.0  118.0  119.0

In [75]:
a.mul(b,fill_value=0)

      0     1      2      3    4
0   0.0   1.0    4.0    9.0  0.0
1  20.0  30.0   42.0   56.0  0.0
2  80.0  99.0  120.0  143.0  0.0
3   0.0   0.0    0.0    0.0  0.0

In [76]:
import pandas as pd
import numpy as np
b = pd.DataFrame(np.arange(20).reshape(4,5))
b

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [78]:
c = pd.Series(np.arange(4))
c

0    0
1    1
2    2
3    3
dtype: int32

In [79]:
c - 10

0   -10
1    -9
2    -8
3    -7
dtype: int32

In [80]:
b - c

      0     1     2     3   4
0   0.0   0.0   0.0   0.0 NaN
1   5.0   5.0   5.0   5.0 NaN
2  10.0  10.0  10.0  10.0 NaN
3  15.0  15.0  15.0  15.0 NaN

b与c的纵轴相减

In [81]:
b.sub(c,axis=0)

    0   1   2   3   4
0   0   1   2   3   4
1   4   5   6   7   8
2   8   9  10  11  12
3  12  13  14  15  16

In [82]:
import pandas as pd
import numpy as np
a = pd.DataFrame(np.arange(12).reshape(3,4))
a

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [84]:
d = pd.DataFrame(np.arange(12,0,-1).reshape(3,4))
d

    0   1   2  3
0  12  11  10  9
1   8   7   6  5
2   4   3   2  1

In [85]:
a > d

       0      1      2      3
0  False  False  False  False
1  False  False  False   True
2   True   True   True   True

In [86]:
a == d

       0      1      2      3
0  False  False  False  False
1  False  False   True  False
2  False  False  False  False

In [87]:
c  = pd.Series(np.arange(4))
c

0    0
1    1
2    2
3    3
dtype: int32

In [89]:
a

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [88]:
a > c

       0      1      2      3
0  False  False  False  False
1   True   True   True   True
2   True   True   True   True

In [90]:
c > 0

0    False
1     True
2     True
3     True
dtype: bool